// Напишите пограмму, которая на вход принимает число и выдает его квадрат
// Например: 4->16
// -3->9

int number = int.Parse(Console.ReadLine())

int result = number*number;

Console.WriteLine(result);